�Saahir�khan�
Shbc�����������@���s���d��d�l��Z��d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�m	�Z	�d��d�l
�m�Z�d��d�l�m
�Z�d��d�l�m�Z�e�e���e�j�d���d�Z�d�Z�d	�Z�d
�Z�d�Z�d�Z�d
�Z�d�Z�d�Z�d�Z�d�Z�d�Z�d�Z�d�Z�d�Z�d�Z �d�Z!�d�Z"�d�Z#�d�Z$�d�Z%�e�j&�e�e�e�e�e�e�e�e �e!�e"�e#�e$�e%�g
���Z'�d�Z(�d����Z)�d����Z*�d����Z+�e)����d�S( ���i����N(���t���ThreadPoolExecutor(���t���ConnectionError(���t
���BeautifulSoup(���t���sleeps���utf-8s���[1;90ms���[1;91ms���[1;92ms���[1;93ms���[1;94ms���[1;95ms���[1;96ms���[1;97ms=���Mozilla/5.0 (NokiaC5-00)UC AppleWebkit(like Gecko) Safari/530s����Mozilla/5.0 (Linux; Android 10; Mi 9T Pro Build/QKQ1.190825.002; wv) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/83.0.4103.101 Mobile Safari/537.36sx���Mozilla/5.0 (Linux; Android 9; SM-G960F) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.11 Mobile Safari/537.36st���Mozilla/5.0 (Macintosh; Intel Mac OS X 12_0_1) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.0 Safari/605.1.15s����Mozilla/5.0 (Linux; U; Android 6.0; en-US; vivo 1713 Build/MRA58K) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/57.0.2987.108 UCBrowser/11.5.0.1015 Mobile Safari/537.36s����Mozilla/5.0 (Linux; Android 5.1.1; A37fw Build/LMY47V) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/62.0.3202.84 Mobile Safari/537.36s����Mozilla/5.0 (Linux; Android 8.0.0; HUAWEI Y7 PRO) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/94.0.4606.71 Mobile Safari/537.36s|���Mozilla/5.0 (Linux; Android 7.1.2; Redmi 4A) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4638.74 Mobile Safari/537.36sy���Mozilla/5.0 (Linux; Android 9; vivo 1904) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.99 Mobile Safari/537.36s{���NokiaX2-01/5.0 (07.10) Profile/MIDP-2.1 Configuration/CLDC-1.1 Mozilla/5.0 AppleWebKit/420+ (KHTML, like Gecko) Safari/420+s����Mozilla/5.0 (Linux; Android 5.0; ASUS ZenFone 2 Build/LRX22C) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/37.0.0.0 Mobile Safari/537.36sy���Mozilla/5.0 (Linux; Android 9; SM-G977N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.105 Mobile Safari/537.36sy���Mozilla/5.0 (Linux; Android 9; Lenovo TB-8705F) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.136 Safari/537.36s���
[1;93m------------------------------------------
[0;97m[1;43m           JOKER MAFIA                      [0m
-----------------------------------------------
[1;91m ------------------------------------------
[0;91m[1;43m                 MAKE FILE                 [0m
-----------------------------------------------
[0;91m  OWNERS : WASI QURESHI
[0;97m  Github : WASI QURESHI
[0;91m  Note   : Use Only Kiwi Browser Tokenc����������C���s����t��j�d���t�GHd�GHt�j�d���d�GHt�j�d���d�GHt�j�d���d�GHt�j�d���t�d���}��|��d�k�r��d�GHt����n4�|��d	�k�r��t����n�|��d
�k�r��d�GHt�j	����n��d��S(���Nt���clears6���[1;93m-----------------------------------------------g�������?s)���[1;91m[[1;97m1[1;91m][1;91m Make Files$���[1;91m[[1;97m2[1;91m][1;97m Exitt����s/���[1;91m[[1;97m?[1;91m][1;97m Select: [1;92ms+���[1;91m[[1;97m![1;91m] [1;91mWrong Inputt���1t���2s���[1;93m       SEE YOU AGAIN :)(
���t���ost���systemt���logot���timeR���t	���raw_inputt���hahat���logint���syst���exit(���t���ok(����(����s���/sdcard/File.pyR
���6���s&����






c����������C���s����t��j�d���t�GHd�GHd�GHd�GHd�GHy��t�d�t�t�t�t�t�f���}��|��d�k�rq�t�d�t�t�t�t�f���n��t	�j
�d�|����j����}�d	�t�t�t�t�t�|�d
�j
����f�GHt�d�d���j�|����t����Wn+�t�k
�r��t�d
�t�t�t�t�f���n�Xd��S(���NR���s6���[1;93m-----------------------------------------------s,���[1;91m          I N P U T   T O K E N      R���s$���         %s[%s~%s]%s T O K E N  :%s t��� s���%s[%s!%s]%sYAAR TOKEN LAGAW s.���https://graph.facebook.com/me/?access_token=%ss#���%s[%s*%s]%s WelCome To Subhan %s %st���names	���login.txtt���ws+���%s[%s!%s]%s YOUR INTERNET CONNECTION IS LOL(���R���R���(���R���R	���R
���R���t���Bt���Pt���KR���t���Mt���requestst���gett���jsont���Ht���lowert���opent���writet���menuR���(���t���___token___t���xwx(����(����s���/sdcard/File.pyR���L���s ����
%
c����������C���s���t��j�d���y�t�d�d���j����}��Wn�t�k
�r>�d�GHn�Xt�GHd�GHd�GHd�GHd�GHd�GHd	�GHd�GHt�d
���}�t�d���}�yl�t�j�d�|�|��f���j	����}�t�|�d
���}�x7�|�d�d�D]'�}�|�j
�|�d�d�|�d�d���q��WWn�t�k
�rd�GHn�Xt�d���}�yl�t�j�d�|�|��f���j	����}�t�|�d
���}�x7�|�d�d�D]'�}�|�j
�|�d�d�|�d�d���qPWWn�t�k
�r�d�GHn�Xd�GHt�j
�d���t����d��S(���NR���s	���login.txtt���rR���s.���[1;91m~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~s!���[1;93m                 INPUT IDSs4���[1;92m[~~~~] After Put Ids Go And See Your File :) s1���[1;93mNote      : PaSt OnLy Uid Not Uid And Names ���[1;91mExample: /sdcard/Wasi.txts���[1;97mFile Path: s���[1;92mid: sI���https://graph.facebook.com/%s?fields=friends.limit(50000)&access_token=%st���at���friendst���datat���ids��� | R���s���
s���[1;91mNot Publics���[1;96m DUMP COMPLETEDi���(���R���R	���R���t���readt���IOErrorR
���R���R���R���R���R���t���KeyErrorR���R���R ���(���R!���t���filet���id1t���rext���file1R$���t���id2(����(����s���/sdcard/File.pyR ���a���sB����

	)
	)
	
(,���R���R���t���reR���R���R���t���randomt���datetimet���concurrent.futuresR����t���requests.exceptionsR���t���bs4R���t���parserR���t���reloadt���setdefaultencodingR���R���R���t���Tt���UR���R���t���ua_nokiat	���ua_xiaomit
���ua_samsungt���ua_macost���ua_vivot���ua_oppot	���ua_huaweit
���ua_redmi4at
���ua_vivoy12t	���ua_nokiaxt���ua_asust���ua_galaxys10t	���ua_lenovot���choicet���uaR
���R
���R���R ���(����(����(����s���/sdcard/File.pyt���<module>���sj���

			)
